
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыСделок.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтатусыСделок КАК СтатусыСделок
		|ГДЕ
		|	СтатусыСделок.НомерПоПорядку <= &НомерПоПорядку";
	
	Запрос.УстановитьПараметр("НомерПоПорядку", СтатусСделки.НомерПоПорядку);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Движения.ВоронкаПродаж.Записывать = Истина;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ВоронкаПродаж.Добавить();
		Движение.Период = Дата;
		Движение.СтатусСделки = ВыборкаДетальныеЗаписи.Ссылка;
		Движение.КоличествоСделок = 1;
		Движение.Сумма = СуммаДокумента;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = Товары.Итог("Сумма");
КонецПроцедуры
