
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ГрафикРаботы                   
	Движения.ГрафикРаботы.Записывать = Истина;	
	ДеньГрафика = ДатаНачала;
	
	Пока ДеньГрафика <= ДатаОкончания Цикл
		
		
		Движение = Движения.ГрафикРаботы.Добавить();
		Движение.Дата = ДеньГрафика;
		
		Если ДеньНедели(ДеньГрафика)<6 Тогда
			
			Движение.РабочийДень = 1;
		Иначе
			Движение.РабочийДень = 0;
		КонецЕсли;
		
		ДеньГрафика = ДеньГрафика + 24*3600;
		
	КонецЦикла;
	
	
	
	

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
